Documents/ВводВОборотКИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводВОборотКИЗ</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</xr:Item>
				<xr:Item>Document.ОтчетОНанесенииКИЗ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияКодовМаркировки</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеКодовМаркировкиСУЗ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтчетОНанесенииКИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыЧЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОНанесенииКИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособВводаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИзготовления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисПровайдеровСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>error_text</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>report_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>status_km</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвижениеКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДвижениеКодовМаркировкиСУЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаТоваров</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихкодНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеКМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Признак</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаЧЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКодНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОНанесенииКИЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВОборотКИЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособВводаВОборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособВводаВОборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркировкаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОтчетОНанесенииКИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОтчетОНанесенииКИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыМаркировкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыМаркировкиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаЭмиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нанесение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОНанесении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нанесен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПризнакКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакКодовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СвойКИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧужойКИЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводВОборотКИЗ/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+Белов А. 21.04.2026 #UT10-5810
	Если СпособВводаВОборот = Перечисления.СпособВводаВОборот.ВозвратОтПокупателя Тогда
		СтруктураОбязательныхПолей = Новый Структура("Организация, ВидПродукции, СпособВводаВОборот");		
	Иначе  
		//-Белов А. 21.04.2026 #UT10-5810
		СтруктураОбязательныхПолей = Новый Структура("Организация, ВидПродукции, СпособИзготовления, СпособВводаВОборот");	
	КонецЕсли;    
	
	Заголовок = "Уажите реквизиты шапки документа";
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Заголовок = "Уажите реквизиты табличной части товары документа";
	
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура");
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Товары.Количество() = 0 Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Не заполнена табличная часть товары");
		
		Отказ = ИСТИНА;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан Тогда
		
		Если ЗначениеЗаполнено(Основание) Тогда
			
			//+Белов А. 21.04.2026 #UT10-5810
			Если СпособВводаВОборот = Перечисления.СпособВводаВОборот.ВозвратОтПокупателя Тогда
				
				НаборДвижений = Движения.ДвижениеКодовМаркировкиСУЗ;
				НаборДвижений.Записывать = Истина;
				
				мТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 
				мТаблицаДвижений.Очистить();
				
				мОсновнойСклад = Константы.ОсновнойСклад.Получить();
				ДокОснование   = Основание;
				
				Для Каждого СтрокаМаркировки Из Товары Цикл
					
					СтрокаДвижений                      = мТаблицаДвижений.Добавить();
					СтрокаДвижений.ШтрихкодНоменклатуры = СтрокаМаркировки.ШтрихКодМаркировки;
					СтрокаДвижений.Количество           = 1;  				
					
				КонецЦикла;	
				
				СтруктТаблицДокумента = Новый Структура;
				СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", мТаблицаДвижений);
				
				ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
				
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Основание", ДокОснование);
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", мОсновнойСклад, "ТаблицаПоТоварам");
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);				
				
			Иначе
			//-Белов А. 21.04.2026 #UT10-5810 
			
				Если ЗначениеЗаполнено(Основание.Основание) Тогда
					
					//+Кабанов А.В. 29.08.2025 # UT10-5361
					НаборДвижений = Движения.ДвижениеКодовМаркировкиСУЗ;
					НаборДвижений.Записывать = Истина;
					
					мТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 
					мТаблицаДвижений.Очистить();
					
					мОсновнойСклад = Константы.ОсновнойСклад.Получить();
					ДокОснование   = Основание.Основание;
					
					Для Каждого СтрокаМаркировки Из Товары Цикл
						
						СтрокаДвижений                      = мТаблицаДвижений.Добавить();
						СтрокаДвижений.ШтрихкодНоменклатуры = СтрокаМаркировки.ШтрихКодМаркировки;
						СтрокаДвижений.Количество           = 1;  				
						
					КонецЦикла;	
					
					СтруктТаблицДокумента = Новый Структура;
					СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", мТаблицаДвижений);
					
					ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
					
					ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Основание", ДокОснование);
					ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", мОсновнойСклад, "ТаблицаПоТоварам");
					ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
					
					//-Кабанов А.В. 29.08.2025 # UT10-5361			
					Если ЗначениеЗаполнено(Основание.Основание.Основание) Тогда
						
						МаркировкаОбъект = Основание.Основание.Основание.ПолучитьОбъект();
						МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.Завершен;
						МаркировкаОбъект.Записать();
						
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли; 
		
		//+Кабанов А.В. 29.08.2025 # UT10-5361 					
	Иначе
		
		Если Проведен Тогда 
			
			НаборОстаткиТоваров = РегистрыНакопления.ДвижениеКодовМаркировкиСУЗ.СоздатьНаборЗаписей();
			НаборОстаткиТоваров.Отбор.Регистратор.Установить(Ссылка);
			НаборОстаткиТоваров.Записать(); 
			
		КонецЕсли;
		
		Если Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен Тогда
			
			НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Ссылка.Дата;
				НоваяЗапись.Документ = Ссылка;
				НоваяЗапись.ШтрихКодНоменклатуры = СтрокаТовары.ШтрихКодМаркировки;
				НоваяЗапись.СостояниеКМ = Перечисления.СостоянияКодовМаркировки.ВведенВОборот;    
				НоваяЗапись.Признак = Перечисления.ПризнакКодовМаркировки.СвойКИЗ;  
				
			КонецЦикла;
			
			НаборЗаписей.Записать();     
			
			//Маркировка.СоздатьИсходящееСообщениеОтчетОНанесенииКИЗ(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
		
		//+Кабанов А.В. 29.08.2025 # UT10-5361 		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда Возврат; КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	ЭтотОбъект.Основание = ДанныеЗаполнения.Ссылка;
	ЭтотОбъект.Номер = "";
	ЭтотОбъект.Дата = ТекущаяДата();
	ЭтотОбъект.Статус = "";
	
	Для Каждого СтрокаТовары ИЗ ДанныеЗаполнения.Товары Цикл
		
		НоваяСтрокаТовары = ЭтотОбъект.Товары.Добавить();
		
		Если НЕ СтрокаТовары.ЧужойКИЗ И НЕ СтрокаТовары.ТоварОтсутствует Тогда 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,СтрокаТовары);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
